{"class_name": "Functional", "config": {"name": "JointL2h512_SeqCnnL2h128_MetRnnL1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1001, 4], "dtype": "float32", "sparse": false, "ragged": false, "name": "dna"}, "name": "dna", "inbound_nodes": []}, {"class_name": "Conv1D", "config": {"name": "dna/conv1d", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [11], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-05, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dna/conv1d", "inbound_nodes": [[["dna", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "dna/activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "dna/activation", "inbound_nodes": [[["dna/conv1d", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "dna/max_pooling1d", "trainable": true, "dtype": "float32", "strides": [4], "pool_size": [4], "padding": "valid", "data_format": "channels_last"}, "name": "dna/max_pooling1d", "inbound_nodes": [[["dna/activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "dna/batch_normalization", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "dna/batch_normalization", "inbound_nodes": [[["dna/max_pooling1d", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "dna/conv1d_1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-05, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dna/conv1d_1", "inbound_nodes": [[["dna/batch_normalization", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "dna/activation_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "dna/activation_1", "inbound_nodes": [[["dna/conv1d_1", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "dna/max_pooling1d_1", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "dna/max_pooling1d_1", "inbound_nodes": [[["dna/activation_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "dna/batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "dna/batch_normalization_1", "inbound_nodes": [[["dna/max_pooling1d_1", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 50], "dtype": "float32", "sparse": false, "ragged": false, "name": "cpg/state"}, "name": "cpg/state", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 50], "dtype": "float32", "sparse": false, "ragged": false, "name": "cpg/dist"}, "name": "cpg/dist", "inbound_nodes": []}, {"class_name": "Flatten", "config": {"name": "dna/flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "dna/flatten", "inbound_nodes": [[["dna/batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "cpg/concatenate", "trainable": true, "dtype": "float32", "axis": 2}, "name": "cpg/concatenate", "inbound_nodes": [[["cpg/state", 0, 0, {}], ["cpg/dist", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dna/dense", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-05, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dna/dense", "inbound_nodes": [[["dna/flatten", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "cpg/time_distributed", "trainable": true, "dtype": "float32", "layer": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-05, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["activation_3", 0, 0]]}}}, "name": "cpg/time_distributed", "inbound_nodes": [[["cpg/concatenate", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "dna/activation_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "dna/activation_2", "inbound_nodes": [[["dna/dense", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "cpg/bidirectional", "trainable": true, "dtype": "float32", "layer": {"class_name": "GRU", "config": {"name": "gru", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 40}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 41}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 42}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-05, "l2": 9.999999747378752e-05}, "shared_object_id": 43}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": true}}, "merge_mode": "concat"}, "name": "cpg/bidirectional", "inbound_nodes": [[["cpg/time_distributed", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dna/dropout", "trainable": true, "dtype": "float32", "rate": 0.0, "noise_shape": null, "seed": null}, "name": "dna/dropout", "inbound_nodes": [[["dna/activation_2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "cpg/dropout_1", "trainable": true, "dtype": "float32", "rate": 0.0, "noise_shape": null, "seed": null}, "name": "cpg/dropout_1", "inbound_nodes": [[["cpg/bidirectional", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_1", "inbound_nodes": [[["dna/dropout", 0, 0, {}], ["cpg/dropout_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "joint/dense_2", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-05, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "joint/dense_2", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "joint/activation_4", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "joint/activation_4", "inbound_nodes": [[["joint/dense_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "joint/batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "joint/batch_normalization_2", "inbound_nodes": [[["joint/activation_4", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "joint/dropout_2", "trainable": true, "dtype": "float32", "rate": 0.0, "noise_shape": null, "seed": null}, "name": "joint/dropout_2", "inbound_nodes": [[["joint/batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "joint/dense_3", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-05, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "joint/dense_3", "inbound_nodes": [[["joint/dropout_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "joint/activation_5", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "joint/activation_5", "inbound_nodes": [[["joint/dense_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "joint/batch_normalization_3", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "joint/batch_normalization_3", "inbound_nodes": [[["joint/activation_5", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "joint/dropout_3", "trainable": true, "dtype": "float32", "rate": 0.0, "noise_shape": null, "seed": null}, "name": "joint/dropout_3", "inbound_nodes": [[["joint/batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "cpg/cell1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "cpg/cell1", "inbound_nodes": [[["joint/dropout_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "cpg/cell2", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "cpg/cell2", "inbound_nodes": [[["joint/dropout_3", 0, 0, {}]]]}], "input_layers": [["dna", 0, 0], ["cpg/state", 0, 0], ["cpg/dist", 0, 0]], "output_layers": [["cpg/cell1", 0, 0], ["cpg/cell2", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}