{"class_name": "Functional", "config": {"name": "RnnL1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 50], "dtype": "float32", "sparse": false, "ragged": false, "name": "cpg/state"}, "name": "cpg/state", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 50], "dtype": "float32", "sparse": false, "ragged": false, "name": "cpg/dist"}, "name": "cpg/dist", "inbound_nodes": []}, {"class_name": "Concatenate", "config": {"name": "cpg/concatenate", "trainable": true, "dtype": "float32", "axis": 2}, "name": "cpg/concatenate", "inbound_nodes": [[["cpg/state", 0, 0, {}], ["cpg/dist", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "cpg/time_distributed", "trainable": true, "dtype": "float32", "layer": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-05, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation", "inbound_nodes": [[["dense", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["activation", 0, 0]]}}}, "name": "cpg/time_distributed", "inbound_nodes": [[["cpg/concatenate", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "cpg/bidirectional", "trainable": true, "dtype": "float32", "layer": {"class_name": "GRU", "config": {"name": "gru", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 11}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 12}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 13}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-05, "l2": 9.999999747378752e-05}, "shared_object_id": 14}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": true}}, "merge_mode": "concat"}, "name": "cpg/bidirectional", "inbound_nodes": [[["cpg/time_distributed", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "cpg/dropout", "trainable": true, "dtype": "float32", "rate": 0.0, "noise_shape": null, "seed": null}, "name": "cpg/dropout", "inbound_nodes": [[["cpg/bidirectional", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "cpg/cell1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "cpg/cell1", "inbound_nodes": [[["cpg/dropout", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "cpg/cell2", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "cpg/cell2", "inbound_nodes": [[["cpg/dropout", 0, 0, {}]]]}], "input_layers": [["cpg/state", 0, 0], ["cpg/dist", 0, 0]], "output_layers": [["cpg/cell1", 0, 0], ["cpg/cell2", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}